//Абстрактные классы в Джава и абстрактные методы класса. Вложенные
//        и анонимные классы.
//        Ответ:
////        Абстрактный класс в Java - это класс, который не может быть
////        использован для создания объектов, но может содержать абстрактные методы,
////        которые должны быть реализованы в дочерних классах.
// Абстрактный метод -
////        это метод, который объявлен, но не имеет реализации в абстрактном классе.
////        Он объявляется с помощью ключевого слова "abstract". Абстрактные классы
////        используются для создания базовых классов, которые определяют общее
////        поведение для группы классов-наследников.

////        Вложенный класс - это класс, который определен внутри другого класса.
////        Он может быть статическим или нестатическим.
// Нестатический вложенный
////        класс называется внутренним классом. Вложенные классы используются для
////        логической группировки классов и улучшения читаемости кода.

////        Анонимный класс - это класс, который не имеет имени и определяется
////        внутри другого класса или метода. Он используется для создания объектов,
////        которые реализуют интерфейсы или наследуются от классов, без явного
////        определения нового класса.
// Анонимные классы могут быть полезны, когда
////        нужно создать объект, который будет использоваться только один раз.

////        Таким образом, абстрактные классы и методы используются для создания
////        базовых классов и определения общего поведения, вложенные классы - для
////        логической группировки классов, а анонимные классы - для создания
////        объектов, которые реализуют интерфейсы или наследуются от классов, без
////        явного определения нового класса
//
//
//
//        Возможости Java Framework Collection. Интерфейс Map и его
//        основные методы
//        Ответ:
////        Контейнер Hashtable является реализацией интерфейса Map и
////        представляет собой структуру данных, в которой данные хранятся в виде пар
////        ключ-значение. Основные методы включают добавление элемента, получение
////        значения по ключу, удаление элемента, проверку наличия ключа и другие
//        операции.